---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.MoveElements
enum: Autodesk.Revit.DB.FailureResolutionType
zh: 移动
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.MoveElements

**中文**: 移动

Defines a resolution of a failure by moving Element(s) to an appropriate location.